[{"description":"<p>The TomTom XXL 535T offers Superior Driving Intelligence with Lifetime Traffic Updates on a widescreen device. Spoken turn-by-turn instructions including street names will guide you to any address in the US and Canada - including more than 7 million preloaded points of interest. \nWith Lifetime Traffic Updates, TomTom automatically updates you with the latest traffic information, recalculates your trip time, and suggests alternate routes. And, only TomTom has IQ ROUTES&quot;*, an exclusive technology that evaluates routes based on actual traffic speeds, rather than static posted speed limits; TomTom will recommend the fastest route for the time \nof day, so you&apos;ll always be directed to the quickest, most-efficient route. \nWith TomTom maps, you&apos;ll have access to one million more miles of road than you would using other GPS brands  making TomTom maps the most accurate and dependable in the industry. <\/p><p \/><p>GPS Features &amp; Benefits:<\/p><ul><li>Expand your driving view with a 5.0&quot; Touchscreen<\/li><li>Get real-time traffic made  easy with Lifetime Traffic Updates<\/li><li>Premium maps of the US &amp; Canada<\/li><li>Always take the fastest route with IQ ROUTES&quot;<\/li><li>Get free updates as often as you like with Map Share&quot;<\/li><li>On Demand Updates<\/li><li>Find gas stations, restaurants and more with over 7 million points of interest<\/li><li>Never miss an exit with Advanced Lane Guidance<\/li><li>Keep your eyes on the road with announced turn-by-turn directions and street names  <\/li><li>Get the most up-to-date map right from the start with Latest Map Guarantee<\/li><li>Travel with peace of mind with Help Me! Emergency Menu<\/li><li>Update and personalize your TomTom with TomTom HOME Content Manager<\/li><li>Plug &amp; Go right out of the box<\/li><li>Easily take your TomTom with you with the Fold &amp; Go EasyPortÂ® Mount<\/li><\/ul>","iD":"vod:14301700","imageThumbnailUrl":"http:\/\/i.walmartimages.com\/i\/p\/00\/63\/69\/26\/03\/0063692603952_60X60.gif","marketingMessage":"<li>Get to your destination easily with help from TomTom\n<\/li><li>Turn-by-turn instructions including street names \n<\/li><li>Includes over 7 million preloaded points of interest <\/li>","name":"TomTom 5.0\" XXL 535T GPS Navigation System","price":"$108.00","productImageUrl":"http:\/\/i.walmartimages.com\/i\/p\/00\/63\/69\/26\/03\/0063692603952_150X150.jpg","ratingUrl":"http:\/\/i2.walmartimages.com\/i\/CustRating\/4_1.gif","rating":"-1","shelfDescription":"<LI>Maps of US & Canada<LI>Lifetime Traffic Updates<LI>7 Million POIs<LI>IQ Routes Technology<LI>Advanced Lane Guidance","uPC":"0063692603952","url":"http:\/\/www.walmart.com\/ip\/TomTom-5.0-XXL-535T-GPS-Navigation-System\/14301700","availableInStore":false,"availableOnline":"true","s2SEnabled":true,"storeOnly":false}]